Revit 2027 API
FailureMessageAccessor.GetSeverity Method
 Retrieves the severity of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureSeverity GetSeverity()
Public Function GetSeverity As FailureSeverity
public:
FailureSeverity GetSeverity()
member GetSeverity : unit -> FailureSeverity
Return Value
FailureSeverity
 The severity of the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace